#### Terraform Validation for infra/tf/environments/dev.yaml 🤖`success`
#### Terraform Plan for infra/tf/environments/dev.yaml📖`success`
<details><summary>Show Plan</summary>
```terraform
google_storage_bucket.buckets["hello-world-dev"]: Refreshing state... [id=hello-world-dev]
module.storage_bucket-iam-bindings["hello-world-dev"].google_storage_bucket_iam_binding.storage_bucket_iam_authoritative["default--roles/storage.objectAdmin"]: Refreshing state... [id=b/hello-world-dev/roles/storage.objectAdmin]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.buckets["hello-world-dev"] will be destroyed
  - resource "google_storage_bucket" "buckets" {
      - bucket_policy_only          = true -> null
      - default_event_based_hold    = false -> null
      - force_destroy               = true -> null
      - id                          = "hello-world-dev" -> null
      - labels                      = {} -> null
      - location                    = "EU" -> null
      - name                        = "hello-world-dev" -> null
      - project                     = "markbox-cts" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/hello-world-dev" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://hello-world-dev" -> null

      - versioning {
          - enabled = true -> null
        }
    }

  # google_storage_bucket.buckets["hello-world-devs"] will be created
  + resource "google_storage_bucket" "buckets" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "hello-world-devs"
      + project                     = "markbox-cts"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.storage_bucket-iam-bindings["hello-world-dev"].google_storage_bucket_iam_binding.storage_bucket_iam_authoritative["default--roles/storage.objectAdmin"] will be destroyed
  - resource "google_storage_bucket_iam_binding" "storage_bucket_iam_authoritative" {
      - bucket  = "b/hello-world-dev" -> null
      - etag    = "CAM=" -> null
      - id      = "b/hello-world-dev/roles/storage.objectAdmin" -> null
      - members = [
          - "serviceAccount:hello-world-app-dev@markbox-cts.iam.gserviceaccount.com",
        ] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.storage_bucket-iam-bindings["hello-world-devs"].google_storage_bucket_iam_binding.storage_bucket_iam_authoritative["default--roles/storage.objectAdmin"] will be created
  + resource "google_storage_bucket_iam_binding" "storage_bucket_iam_authoritative" {
      + bucket  = "hello-world-devs"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:hello-world-app-dev@markbox-cts.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on main.tf line 3, in terraform:
   3:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @mark-cts, Action: `pull_request`*